benchmarks/20260808T170324Z/results/gemma-4-E4B-it-NVFP4/gemma-4-E4B-it-NVFP4__throughput__2.stdout.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x75ee24a43ce0>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=512, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=16, model='unsloth/gemma-4-E4B-it-NVFP4', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/workspace/gemma4-benchmark/results/gemma-4-E4B-it-NVFP4', result_filename='gemma-4-E4B-it-NVFP4__throughput__2.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-427174a1-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-08 16:57:19 [utils.py:90] Sampling input_len from [512, 512] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  18.83     
Total input tokens:                      52144     
Total generated tokens:                  51200     
Request throughput (req/s):              5.31      
Output token throughput (tok/s):         2718.52   
Peak output token throughput (tok/s):    3088.00   
Peak concurrent requests:                32.00     
Total token throughput (tok/s):          5487.17   
---------------Time to First Token----------------
Mean TTFT (ms):                          48.41     
Median TTFT (ms):                        47.30     
P50 TTFT (ms):                           47.30     
P90 TTFT (ms):                           62.34     
P99 TTFT (ms):                           64.78     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          5.21      
Median TPOT (ms):                        5.22      
P50 TPOT (ms):                           5.22      
P90 TPOT (ms):                           5.25      
P99 TPOT (ms):                           5.25      
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2711.03   
Median E2EL (ms):                        2719.25   
P50 E2EL (ms):                           2719.25   
P90 E2EL (ms):                           2727.83   
P99 E2EL (ms):                           2729.43   
==================================================
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:02<04:28,  2.71s/it]
 17%|█▋        | 17/100 [00:05<00:22,  3.62it/s]
 33%|███▎      | 33/100 [00:08<00:14,  4.65it/s]
 49%|████▉     | 49/100 [00:10<00:09,  5.14it/s]
 65%|██████▌   | 65/100 [00:13<00:06,  5.41it/s]
 81%|████████  | 81/100 [00:16<00:03,  5.57it/s]
 97%|█████████▋| 97/100 [00:18<00:00,  5.81it/s]
100%|██████████| 100/100 [00:18<00:00,  5.31it/s]